========
Integers
========

5
050

--------
(source_file
  (integer_literal)
  (integer_literal))

=============
Simple floats
=============

12.345
-5.2

-------------
(source_file
  (float_literal)
  (float_literal))

=================
Scientific floats
=================

1e10
3.14e2

-----------------
(source_file
  (float_literal)
  (float_literal))

=================
Floats with error
=================

2.7`_0.12
9.0_.24
132.23` 910.14
37.2_0.333
-----------------
(source_file
  (float_literal)
  (float_literal)
  (float_literal)
  (float_literal)
  (float_literal))

===================
Number in a comment
===================
'12

-------------------
(source_file
    (line_comment))
